valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxMtu_reg.h
/** \brief B94, Read Data and Bit Flip Register 26 */
#define MTU_MC11_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B94u)

/** \brief B96, Read Data and Bit Flip Register 27 */
#define MTU_MC11_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B96u)

/** \brief B98, Read Data and Bit Flip Register 28 */
#define MTU_MC11_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B98u)

/** \brief B9A, Read Data and Bit Flip Register 29 */
#define MTU_MC11_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B9Au)

/** \brief B9C, Read Data and Bit Flip Register 30 */
#define MTU_MC11_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B9Cu)

/** \brief B9E, Read Data and Bit Flip Register 31 */
#define MTU_MC11_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B9Eu)

/** \brief BA0, Read Data and Bit Flip Register 32 */
#define MTU_MC11_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BA0u)

/** \brief BA2, Read Data and Bit Flip Register 33 */
#define MTU_MC11_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BA2u)

/** \brief BA4, Read Data and Bit Flip Register 34 */
#define MTU_MC11_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BA4u)

/** \brief BA6, Read Data and Bit Flip Register 35 */
#define MTU_MC11_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BA6u)

/** \brief BA8, Read Data and Bit Flip Register 36 */
#define MTU_MC11_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BA8u)

/** \brief BAA, Read Data and Bit Flip Register 37 */
#define MTU_MC11_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BAAu)

/** \brief BAC, Read Data and Bit Flip Register 38 */
#define MTU_MC11_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BACu)

/** \brief BAE, Read Data and Bit Flip Register 39 */
#define MTU_MC11_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BAEu)

/** \brief BB0, Read Data and Bit Flip Register 40 */
#define MTU_MC11_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BB0u)

/** \brief BB2, Read Data and Bit Flip Register 41 */
#define MTU_MC11_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BB2u)

/** \brief BB4, Read Data and Bit Flip Register 42 */
#define MTU_MC11_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BB4u)

/** \brief BB6, Read Data and Bit Flip Register 43 */
#define MTU_MC11_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BB6u)

/** \brief BB8, Read Data and Bit Flip Register 44 */
#define MTU_MC11_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BB8u)

/** \brief BBA, Read Data and Bit Flip Register 45 */
#define MTU_MC11_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BBAu)

/** \brief BBC, Read Data and Bit Flip Register 46 */
#define MTU_MC11_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BBCu)

/** \brief BBE, Read Data and Bit Flip Register 47 */
#define MTU_MC11_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BBEu)

/** \brief BC0, Read Data and Bit Flip Register 48 */
#define MTU_MC11_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BC0u)

/** \brief BC2, Read Data and Bit Flip Register 49 */
#define MTU_MC11_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BC2u)

/** \brief BC4, Read Data and Bit Flip Register 50 */
#define MTU_MC11_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BC4u)

/** \brief BC6, Read Data and Bit Flip Register 51 */
#define MTU_MC11_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BC6u)

/** \brief BC8, Read Data and Bit Flip Register 52 */
#define MTU_MC11_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BC8u)

/** \brief BCA, Read Data and Bit Flip Register 53 */
#define MTU_MC11_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BCAu)

/** \brief BCC, Read Data and Bit Flip Register 54 */
#define MTU_MC11_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BCCu)

/** \brief BCE, Read Data and Bit Flip Register 55 */
#define MTU_MC11_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BCEu)

/** \brief BD0, Read Data and Bit Flip Register 56 */
#define MTU_MC11_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD0u)

/** \brief BD2, Read Data and Bit Flip Register 57 */
#define MTU_MC11_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD2u)

/** \brief BD4, Read Data and Bit Flip Register 58 */
#define MTU_MC11_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD4u)

/** \brief BD6, Read Data and Bit Flip Register 59 */
#define MTU_MC11_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD6u)

/** \brief BD8, Read Data and Bit Flip Register 60 */
#define MTU_MC11_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD8u)

/** \brief BDA, Read Data and Bit Flip Register 61 */
#define MTU_MC11_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BDAu)

/** \brief BDC, Read Data and Bit Flip Register 62 */
#define MTU_MC11_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BDCu)

/** \brief BDE, Read Data and Bit Flip Register 63 */
#define MTU_MC11_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BDEu)

/** \brief BE0, Read Data and Bit Flip Register 64 */
#define MTU_MC11_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BE0u)

/** \brief BE2, Read Data and Bit Flip Register 65 */
#define MTU_MC11_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BE2u)

/** \brief BE4, Read Data and Bit Flip Register 66 */
#define MTU_MC11_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BE4u)

