valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxMtu_reg.h
/** \brief 1198, Read Data and Bit Flip Register 28 */
#define MTU_MC17_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062198u)

/** \brief 119A, Read Data and Bit Flip Register 29 */
#define MTU_MC17_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006219Au)

/** \brief 119C, Read Data and Bit Flip Register 30 */
#define MTU_MC17_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006219Cu)

/** \brief 119E, Read Data and Bit Flip Register 31 */
#define MTU_MC17_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006219Eu)

/** \brief 11A0, Read Data and Bit Flip Register 32 */
#define MTU_MC17_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621A0u)

/** \brief 11A2, Read Data and Bit Flip Register 33 */
#define MTU_MC17_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621A2u)

/** \brief 11A4, Read Data and Bit Flip Register 34 */
#define MTU_MC17_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621A4u)

/** \brief 11A6, Read Data and Bit Flip Register 35 */
#define MTU_MC17_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621A6u)

/** \brief 11A8, Read Data and Bit Flip Register 36 */
#define MTU_MC17_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621A8u)

/** \brief 11AA, Read Data and Bit Flip Register 37 */
#define MTU_MC17_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621AAu)

/** \brief 11AC, Read Data and Bit Flip Register 38 */
#define MTU_MC17_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621ACu)

/** \brief 11AE, Read Data and Bit Flip Register 39 */
#define MTU_MC17_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621AEu)

/** \brief 11B0, Read Data and Bit Flip Register 40 */
#define MTU_MC17_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621B0u)

/** \brief 11B2, Read Data and Bit Flip Register 41 */
#define MTU_MC17_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621B2u)

/** \brief 11B4, Read Data and Bit Flip Register 42 */
#define MTU_MC17_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621B4u)

/** \brief 11B6, Read Data and Bit Flip Register 43 */
#define MTU_MC17_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621B6u)

/** \brief 11B8, Read Data and Bit Flip Register 44 */
#define MTU_MC17_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621B8u)

/** \brief 11BA, Read Data and Bit Flip Register 45 */
#define MTU_MC17_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621BAu)

/** \brief 11BC, Read Data and Bit Flip Register 46 */
#define MTU_MC17_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621BCu)

/** \brief 11BE, Read Data and Bit Flip Register 47 */
#define MTU_MC17_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621BEu)

/** \brief 11C0, Read Data and Bit Flip Register 48 */
#define MTU_MC17_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621C0u)

/** \brief 11C2, Read Data and Bit Flip Register 49 */
#define MTU_MC17_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621C2u)

/** \brief 11C4, Read Data and Bit Flip Register 50 */
#define MTU_MC17_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621C4u)

/** \brief 11C6, Read Data and Bit Flip Register 51 */
#define MTU_MC17_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621C6u)

/** \brief 11C8, Read Data and Bit Flip Register 52 */
#define MTU_MC17_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621C8u)

/** \brief 11CA, Read Data and Bit Flip Register 53 */
#define MTU_MC17_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621CAu)

/** \brief 11CC, Read Data and Bit Flip Register 54 */
#define MTU_MC17_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621CCu)

/** \brief 11CE, Read Data and Bit Flip Register 55 */
#define MTU_MC17_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621CEu)

/** \brief 11D0, Read Data and Bit Flip Register 56 */
#define MTU_MC17_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621D0u)

/** \brief 11D2, Read Data and Bit Flip Register 57 */
#define MTU_MC17_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621D2u)

/** \brief 11D4, Read Data and Bit Flip Register 58 */
#define MTU_MC17_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621D4u)

/** \brief 11D6, Read Data and Bit Flip Register 59 */
#define MTU_MC17_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621D6u)

/** \brief 11D8, Read Data and Bit Flip Register 60 */
#define MTU_MC17_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621D8u)

/** \brief 11DA, Read Data and Bit Flip Register 61 */
#define MTU_MC17_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621DAu)

/** \brief 11DC, Read Data and Bit Flip Register 62 */
#define MTU_MC17_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621DCu)

/** \brief 11DE, Read Data and Bit Flip Register 63 */
#define MTU_MC17_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621DEu)

/** \brief 11E0, Read Data and Bit Flip Register 64 */
#define MTU_MC17_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621E0u)

/** \brief 11E2, Read Data and Bit Flip Register 65 */
#define MTU_MC17_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621E2u)

/** \brief 11E4, Read Data and Bit Flip Register 66 */
#define MTU_MC17_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00621E4u)

/** \brief 11EE, Alarm Sources Configuration Register */
#define MTU_MC17_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00621EEu)

/** \brief 11F0, SSH Safety Faults Status Register  */
#define MTU_MC17_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00621F0u)

/** \brief 11F2, Error Information Register 0 */
#define MTU_MC17_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00621F2u)

