valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxMtu_reg.h
/** \brief 11F4, Error Information Register 1 */
#define MTU_MC17_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00621F4u)

/** \brief 11F6, Error Information Register 2 */
#define MTU_MC17_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00621F6u)

/** \brief 11F8, Error Information Register 3 */
#define MTU_MC17_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00621F8u)

/** \brief 11FA, Error Information Register 4 */
#define MTU_MC17_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00621FAu)

/** \brief 1200, Configuration Registers */
#define MTU_MC18_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062200u)

/** \brief 1202, Configuration Register 1 */
#define MTU_MC18_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062202u)

/** \brief 1204, MBIST Control Register */
#define MTU_MC18_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062204u)

/** \brief 1206, Status Register */
#define MTU_MC18_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062206u)

/** \brief 1208, Range Register, single address mode */
#define MTU_MC18_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062208u)

/** \brief 120C, Revision ID Register */
#define MTU_MC18_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006220Cu)

/** \brief 120E, ECC Safety Register */
#define MTU_MC18_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006220Eu)

/** \brief 1210, Memory ECC Detection Register */
#define MTU_MC18_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062210u)

/** \brief 1212, Error Tracking Register 0 */
#define MTU_MC18_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062212u)

/** \brief 1214, Error Tracking Register 1 */
#define MTU_MC18_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062214u)

/** \brief 1216, Error Tracking Register 2 */
#define MTU_MC18_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062216u)

/** \brief 1218, Error Tracking Register 3 */
#define MTU_MC18_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062218u)

/** \brief 121A, Error Tracking Register 4 */
#define MTU_MC18_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006221Au)

/** \brief 1260, Read Data and Bit Flip Register 0 */
#define MTU_MC18_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062260u)

/** \brief 1262, Read Data and Bit Flip Register 1 */
#define MTU_MC18_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062262u)

/** \brief 1264, Read Data and Bit Flip Register 2 */
#define MTU_MC18_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062264u)

/** \brief 1266, Read Data and Bit Flip Register 3 */
#define MTU_MC18_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062266u)

/** \brief 1268, Read Data and Bit Flip Register 4 */
#define MTU_MC18_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062268u)

/** \brief 126A, Read Data and Bit Flip Register 5 */
#define MTU_MC18_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006226Au)

/** \brief 126C, Read Data and Bit Flip Register 6 */
#define MTU_MC18_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006226Cu)

/** \brief 126E, Read Data and Bit Flip Register 7 */
#define MTU_MC18_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006226Eu)

/** \brief 1270, Read Data and Bit Flip Register 8 */
#define MTU_MC18_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062270u)

/** \brief 1272, Read Data and Bit Flip Register 9 */
#define MTU_MC18_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062272u)

/** \brief 1274, Read Data and Bit Flip Register 10 */
#define MTU_MC18_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062274u)

/** \brief 1276, Read Data and Bit Flip Register 11 */
#define MTU_MC18_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062276u)

/** \brief 1278, Read Data and Bit Flip Register 12 */
#define MTU_MC18_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062278u)

/** \brief 127A, Read Data and Bit Flip Register 13 */
#define MTU_MC18_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006227Au)

/** \brief 127C, Read Data and Bit Flip Register 14 */
#define MTU_MC18_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006227Cu)

/** \brief 127E, Read Data and Bit Flip Register 15 */
#define MTU_MC18_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006227Eu)

/** \brief 1280, Read Data and Bit Flip Register 16 */
#define MTU_MC18_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062280u)

/** \brief 1282, Read Data and Bit Flip Register 17 */
#define MTU_MC18_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062282u)

/** \brief 1284, Read Data and Bit Flip Register 18 */
#define MTU_MC18_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062284u)

/** \brief 1286, Read Data and Bit Flip Register 19 */
#define MTU_MC18_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062286u)

/** \brief 1288, Read Data and Bit Flip Register 20 */
#define MTU_MC18_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062288u)

/** \brief 128A, Read Data and Bit Flip Register 21 */
#define MTU_MC18_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006228Au)

/** \brief 128C, Read Data and Bit Flip Register 22 */
#define MTU_MC18_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006228Cu)

/** \brief 128E, Read Data and Bit Flip Register 23 */
#define MTU_MC18_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006228Eu)

/** \brief 1290, Read Data and Bit Flip Register 24 */
#define MTU_MC18_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062290u)

/** \brief 1292, Read Data and Bit Flip Register 25 */
#define MTU_MC18_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062292u)

