valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxMtu_reg.h
/** \brief 14F0, SSH Safety Faults Status Register  */
#define MTU_MC20_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00624F0u)

/** \brief 14F2, Error Information Register 0 */
#define MTU_MC20_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00624F2u)

/** \brief 14F4, Error Information Register 1 */
#define MTU_MC20_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00624F4u)

/** \brief 14F6, Error Information Register 2 */
#define MTU_MC20_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00624F6u)

/** \brief 14F8, Error Information Register 3 */
#define MTU_MC20_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00624F8u)

/** \brief 14FA, Error Information Register 4 */
#define MTU_MC20_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00624FAu)

/** \brief 1500, Configuration Registers */
#define MTU_MC21_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062500u)

/** \brief 1502, Configuration Register 1 */
#define MTU_MC21_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062502u)

/** \brief 1504, MBIST Control Register */
#define MTU_MC21_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062504u)

/** \brief 1506, Status Register */
#define MTU_MC21_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062506u)

/** \brief 1508, Range Register, single address mode */
#define MTU_MC21_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062508u)

/** \brief 150C, Revision ID Register */
#define MTU_MC21_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006250Cu)

/** \brief 150E, ECC Safety Register */
#define MTU_MC21_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006250Eu)

/** \brief 1510, Memory ECC Detection Register */
#define MTU_MC21_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062510u)

/** \brief 1512, Error Tracking Register 0 */
#define MTU_MC21_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062512u)

/** \brief 1514, Error Tracking Register 1 */
#define MTU_MC21_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062514u)

/** \brief 1516, Error Tracking Register 2 */
#define MTU_MC21_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062516u)

/** \brief 1518, Error Tracking Register 3 */
#define MTU_MC21_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062518u)

/** \brief 151A, Error Tracking Register 4 */
#define MTU_MC21_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006251Au)

/** \brief 1560, Read Data and Bit Flip Register 0 */
#define MTU_MC21_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062560u)

/** \brief 1562, Read Data and Bit Flip Register 1 */
#define MTU_MC21_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062562u)

/** \brief 1564, Read Data and Bit Flip Register 2 */
#define MTU_MC21_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062564u)

/** \brief 1566, Read Data and Bit Flip Register 3 */
#define MTU_MC21_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062566u)

/** \brief 1568, Read Data and Bit Flip Register 4 */
#define MTU_MC21_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062568u)

/** \brief 156A, Read Data and Bit Flip Register 5 */
#define MTU_MC21_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006256Au)

/** \brief 156C, Read Data and Bit Flip Register 6 */
#define MTU_MC21_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006256Cu)

/** \brief 156E, Read Data and Bit Flip Register 7 */
#define MTU_MC21_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006256Eu)

/** \brief 1570, Read Data and Bit Flip Register 8 */
#define MTU_MC21_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062570u)

/** \brief 1572, Read Data and Bit Flip Register 9 */
#define MTU_MC21_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062572u)

/** \brief 1574, Read Data and Bit Flip Register 10 */
#define MTU_MC21_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062574u)

/** \brief 1576, Read Data and Bit Flip Register 11 */
#define MTU_MC21_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062576u)

/** \brief 1578, Read Data and Bit Flip Register 12 */
#define MTU_MC21_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062578u)

/** \brief 157A, Read Data and Bit Flip Register 13 */
#define MTU_MC21_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006257Au)

/** \brief 157C, Read Data and Bit Flip Register 14 */
#define MTU_MC21_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006257Cu)

/** \brief 157E, Read Data and Bit Flip Register 15 */
#define MTU_MC21_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006257Eu)

/** \brief 1580, Read Data and Bit Flip Register 16 */
#define MTU_MC21_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062580u)

/** \brief 1582, Read Data and Bit Flip Register 17 */
#define MTU_MC21_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062582u)

/** \brief 1584, Read Data and Bit Flip Register 18 */
#define MTU_MC21_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062584u)

/** \brief 1586, Read Data and Bit Flip Register 19 */
#define MTU_MC21_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062586u)

/** \brief 1588, Read Data and Bit Flip Register 20 */
#define MTU_MC21_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062588u)

/** \brief 158A, Read Data and Bit Flip Register 21 */
#define MTU_MC21_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006258Au)

/** \brief 158C, Read Data and Bit Flip Register 22 */
#define MTU_MC21_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006258Cu)

/** \brief 158E, Read Data and Bit Flip Register 23 */
#define MTU_MC21_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006258Eu)

