valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxMtu_reg.h
/** \brief 1C18, Error Tracking Register 3 */
#define MTU_MC28_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062C18u)

/** \brief 1C1A, Error Tracking Register 4 */
#define MTU_MC28_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062C1Au)

/** \brief 1C60, Read Data and Bit Flip Register 0 */
#define MTU_MC28_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C60u)

/** \brief 1C62, Read Data and Bit Flip Register 1 */
#define MTU_MC28_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C62u)

/** \brief 1C64, Read Data and Bit Flip Register 2 */
#define MTU_MC28_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C64u)

/** \brief 1C66, Read Data and Bit Flip Register 3 */
#define MTU_MC28_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C66u)

/** \brief 1C68, Read Data and Bit Flip Register 4 */
#define MTU_MC28_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C68u)

/** \brief 1C6A, Read Data and Bit Flip Register 5 */
#define MTU_MC28_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C6Au)

/** \brief 1C6C, Read Data and Bit Flip Register 6 */
#define MTU_MC28_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C6Cu)

/** \brief 1C6E, Read Data and Bit Flip Register 7 */
#define MTU_MC28_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C6Eu)

/** \brief 1C70, Read Data and Bit Flip Register 8 */
#define MTU_MC28_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C70u)

/** \brief 1C72, Read Data and Bit Flip Register 9 */
#define MTU_MC28_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C72u)

/** \brief 1C74, Read Data and Bit Flip Register 10 */
#define MTU_MC28_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C74u)

/** \brief 1C76, Read Data and Bit Flip Register 11 */
#define MTU_MC28_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C76u)

/** \brief 1C78, Read Data and Bit Flip Register 12 */
#define MTU_MC28_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C78u)

/** \brief 1C7A, Read Data and Bit Flip Register 13 */
#define MTU_MC28_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C7Au)

/** \brief 1C7C, Read Data and Bit Flip Register 14 */
#define MTU_MC28_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C7Cu)

/** \brief 1C7E, Read Data and Bit Flip Register 15 */
#define MTU_MC28_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C7Eu)

/** \brief 1C80, Read Data and Bit Flip Register 16 */
#define MTU_MC28_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C80u)

/** \brief 1C82, Read Data and Bit Flip Register 17 */
#define MTU_MC28_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C82u)

/** \brief 1C84, Read Data and Bit Flip Register 18 */
#define MTU_MC28_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C84u)

/** \brief 1C86, Read Data and Bit Flip Register 19 */
#define MTU_MC28_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C86u)

/** \brief 1C88, Read Data and Bit Flip Register 20 */
#define MTU_MC28_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C88u)

/** \brief 1C8A, Read Data and Bit Flip Register 21 */
#define MTU_MC28_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C8Au)

/** \brief 1C8C, Read Data and Bit Flip Register 22 */
#define MTU_MC28_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C8Cu)

/** \brief 1C8E, Read Data and Bit Flip Register 23 */
#define MTU_MC28_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C8Eu)

/** \brief 1C90, Read Data and Bit Flip Register 24 */
#define MTU_MC28_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C90u)

/** \brief 1C92, Read Data and Bit Flip Register 25 */
#define MTU_MC28_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C92u)

/** \brief 1C94, Read Data and Bit Flip Register 26 */
#define MTU_MC28_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C94u)

/** \brief 1C96, Read Data and Bit Flip Register 27 */
#define MTU_MC28_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C96u)

/** \brief 1C98, Read Data and Bit Flip Register 28 */
#define MTU_MC28_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C98u)

/** \brief 1C9A, Read Data and Bit Flip Register 29 */
#define MTU_MC28_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C9Au)

/** \brief 1C9C, Read Data and Bit Flip Register 30 */
#define MTU_MC28_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C9Cu)

/** \brief 1C9E, Read Data and Bit Flip Register 31 */
#define MTU_MC28_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062C9Eu)

/** \brief 1CA0, Read Data and Bit Flip Register 32 */
#define MTU_MC28_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CA0u)

/** \brief 1CA2, Read Data and Bit Flip Register 33 */
#define MTU_MC28_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CA2u)

/** \brief 1CA4, Read Data and Bit Flip Register 34 */
#define MTU_MC28_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CA4u)

/** \brief 1CA6, Read Data and Bit Flip Register 35 */
#define MTU_MC28_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CA6u)

/** \brief 1CA8, Read Data and Bit Flip Register 36 */
#define MTU_MC28_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CA8u)

/** \brief 1CAA, Read Data and Bit Flip Register 37 */
#define MTU_MC28_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CAAu)

/** \brief 1CAC, Read Data and Bit Flip Register 38 */
#define MTU_MC28_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CACu)

/** \brief 1CAE, Read Data and Bit Flip Register 39 */
#define MTU_MC28_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062CAEu)

