valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxMtu_reg.h
/** \brief 2476, Read Data and Bit Flip Register 11 */
#define MTU_MC36_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063476u)

/** \brief 2478, Read Data and Bit Flip Register 12 */
#define MTU_MC36_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063478u)

/** \brief 247A, Read Data and Bit Flip Register 13 */
#define MTU_MC36_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006347Au)

/** \brief 247C, Read Data and Bit Flip Register 14 */
#define MTU_MC36_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006347Cu)

/** \brief 247E, Read Data and Bit Flip Register 15 */
#define MTU_MC36_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006347Eu)

/** \brief 2480, Read Data and Bit Flip Register 16 */
#define MTU_MC36_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063480u)

/** \brief 2482, Read Data and Bit Flip Register 17 */
#define MTU_MC36_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063482u)

/** \brief 2484, Read Data and Bit Flip Register 18 */
#define MTU_MC36_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063484u)

/** \brief 2486, Read Data and Bit Flip Register 19 */
#define MTU_MC36_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063486u)

/** \brief 2488, Read Data and Bit Flip Register 20 */
#define MTU_MC36_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063488u)

/** \brief 248A, Read Data and Bit Flip Register 21 */
#define MTU_MC36_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006348Au)

/** \brief 248C, Read Data and Bit Flip Register 22 */
#define MTU_MC36_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006348Cu)

/** \brief 248E, Read Data and Bit Flip Register 23 */
#define MTU_MC36_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006348Eu)

/** \brief 2490, Read Data and Bit Flip Register 24 */
#define MTU_MC36_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063490u)

/** \brief 2492, Read Data and Bit Flip Register 25 */
#define MTU_MC36_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063492u)

/** \brief 2494, Read Data and Bit Flip Register 26 */
#define MTU_MC36_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063494u)

/** \brief 2496, Read Data and Bit Flip Register 27 */
#define MTU_MC36_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063496u)

/** \brief 2498, Read Data and Bit Flip Register 28 */
#define MTU_MC36_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063498u)

/** \brief 249A, Read Data and Bit Flip Register 29 */
#define MTU_MC36_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006349Au)

/** \brief 249C, Read Data and Bit Flip Register 30 */
#define MTU_MC36_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006349Cu)

/** \brief 249E, Read Data and Bit Flip Register 31 */
#define MTU_MC36_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006349Eu)

/** \brief 24A0, Read Data and Bit Flip Register 32 */
#define MTU_MC36_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634A0u)

/** \brief 24A2, Read Data and Bit Flip Register 33 */
#define MTU_MC36_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634A2u)

/** \brief 24A4, Read Data and Bit Flip Register 34 */
#define MTU_MC36_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634A4u)

/** \brief 24A6, Read Data and Bit Flip Register 35 */
#define MTU_MC36_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634A6u)

/** \brief 24A8, Read Data and Bit Flip Register 36 */
#define MTU_MC36_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634A8u)

/** \brief 24AA, Read Data and Bit Flip Register 37 */
#define MTU_MC36_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634AAu)

/** \brief 24AC, Read Data and Bit Flip Register 38 */
#define MTU_MC36_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634ACu)

/** \brief 24AE, Read Data and Bit Flip Register 39 */
#define MTU_MC36_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634AEu)

/** \brief 24B0, Read Data and Bit Flip Register 40 */
#define MTU_MC36_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634B0u)

/** \brief 24B2, Read Data and Bit Flip Register 41 */
#define MTU_MC36_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634B2u)

/** \brief 24B4, Read Data and Bit Flip Register 42 */
#define MTU_MC36_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634B4u)

/** \brief 24B6, Read Data and Bit Flip Register 43 */
#define MTU_MC36_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634B6u)

/** \brief 24B8, Read Data and Bit Flip Register 44 */
#define MTU_MC36_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634B8u)

/** \brief 24BA, Read Data and Bit Flip Register 45 */
#define MTU_MC36_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634BAu)

/** \brief 24BC, Read Data and Bit Flip Register 46 */
#define MTU_MC36_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634BCu)

/** \brief 24BE, Read Data and Bit Flip Register 47 */
#define MTU_MC36_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634BEu)

/** \brief 24C0, Read Data and Bit Flip Register 48 */
#define MTU_MC36_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634C0u)

/** \brief 24C2, Read Data and Bit Flip Register 49 */
#define MTU_MC36_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634C2u)

/** \brief 24C4, Read Data and Bit Flip Register 50 */
#define MTU_MC36_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634C4u)

/** \brief 24C6, Read Data and Bit Flip Register 51 */
#define MTU_MC36_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634C6u)

/** \brief 24C8, Read Data and Bit Flip Register 52 */
#define MTU_MC36_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634C8u)

/** \brief 24CA, Read Data and Bit Flip Register 53 */
#define MTU_MC36_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634CAu)

