valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxMtu_reg.h
/** \brief 2AA6, Read Data and Bit Flip Register 35 */
#define MTU_MC42_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AA6u)

/** \brief 2AA8, Read Data and Bit Flip Register 36 */
#define MTU_MC42_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AA8u)

/** \brief 2AAA, Read Data and Bit Flip Register 37 */
#define MTU_MC42_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AAAu)

/** \brief 2AAC, Read Data and Bit Flip Register 38 */
#define MTU_MC42_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AACu)

/** \brief 2AAE, Read Data and Bit Flip Register 39 */
#define MTU_MC42_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AAEu)

/** \brief 2AB0, Read Data and Bit Flip Register 40 */
#define MTU_MC42_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AB0u)

/** \brief 2AB2, Read Data and Bit Flip Register 41 */
#define MTU_MC42_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AB2u)

/** \brief 2AB4, Read Data and Bit Flip Register 42 */
#define MTU_MC42_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AB4u)

/** \brief 2AB6, Read Data and Bit Flip Register 43 */
#define MTU_MC42_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AB6u)

/** \brief 2AB8, Read Data and Bit Flip Register 44 */
#define MTU_MC42_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AB8u)

/** \brief 2ABA, Read Data and Bit Flip Register 45 */
#define MTU_MC42_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ABAu)

/** \brief 2ABC, Read Data and Bit Flip Register 46 */
#define MTU_MC42_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ABCu)

/** \brief 2ABE, Read Data and Bit Flip Register 47 */
#define MTU_MC42_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ABEu)

/** \brief 2AC0, Read Data and Bit Flip Register 48 */
#define MTU_MC42_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AC0u)

/** \brief 2AC2, Read Data and Bit Flip Register 49 */
#define MTU_MC42_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AC2u)

/** \brief 2AC4, Read Data and Bit Flip Register 50 */
#define MTU_MC42_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AC4u)

/** \brief 2AC6, Read Data and Bit Flip Register 51 */
#define MTU_MC42_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AC6u)

/** \brief 2AC8, Read Data and Bit Flip Register 52 */
#define MTU_MC42_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AC8u)

/** \brief 2ACA, Read Data and Bit Flip Register 53 */
#define MTU_MC42_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ACAu)

/** \brief 2ACC, Read Data and Bit Flip Register 54 */
#define MTU_MC42_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ACCu)

/** \brief 2ACE, Read Data and Bit Flip Register 55 */
#define MTU_MC42_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ACEu)

/** \brief 2AD0, Read Data and Bit Flip Register 56 */
#define MTU_MC42_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AD0u)

/** \brief 2AD2, Read Data and Bit Flip Register 57 */
#define MTU_MC42_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AD2u)

/** \brief 2AD4, Read Data and Bit Flip Register 58 */
#define MTU_MC42_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AD4u)

/** \brief 2AD6, Read Data and Bit Flip Register 59 */
#define MTU_MC42_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AD6u)

/** \brief 2AD8, Read Data and Bit Flip Register 60 */
#define MTU_MC42_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AD8u)

/** \brief 2ADA, Read Data and Bit Flip Register 61 */
#define MTU_MC42_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ADAu)

/** \brief 2ADC, Read Data and Bit Flip Register 62 */
#define MTU_MC42_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ADCu)

/** \brief 2ADE, Read Data and Bit Flip Register 63 */
#define MTU_MC42_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ADEu)

/** \brief 2AE0, Read Data and Bit Flip Register 64 */
#define MTU_MC42_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AE0u)

/** \brief 2AE2, Read Data and Bit Flip Register 65 */
#define MTU_MC42_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AE2u)

/** \brief 2AE4, Read Data and Bit Flip Register 66 */
#define MTU_MC42_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AE4u)

/** \brief 2AEE, Alarm Sources Configuration Register */
#define MTU_MC42_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0063AEEu)

/** \brief 2AF0, SSH Safety Faults Status Register  */
#define MTU_MC42_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0063AF0u)

/** \brief 2AF2, Error Information Register 0 */
#define MTU_MC42_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063AF2u)

/** \brief 2AF4, Error Information Register 1 */
#define MTU_MC42_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063AF4u)

/** \brief 2AF6, Error Information Register 2 */
#define MTU_MC42_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063AF6u)

/** \brief 2AF8, Error Information Register 3 */
#define MTU_MC42_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063AF8u)

/** \brief 2AFA, Error Information Register 4 */
#define MTU_MC42_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063AFAu)

/** \brief 2B00, Configuration Registers */
#define MTU_MC43_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063B00u)

/** \brief 2B02, Configuration Register 1 */
#define MTU_MC43_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063B02u)

/** \brief 2B04, MBIST Control Register */
#define MTU_MC43_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063B04u)

/** \brief 2B06, Status Register */
#define MTU_MC43_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063B06u)

/** \brief 2B08, Range Register, single address mode */
#define MTU_MC43_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063B08u)

/** \brief 2B0C, Revision ID Register */
#define MTU_MC43_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063B0Cu)

/** \brief 2B0E, ECC Safety Register */
#define MTU_MC43_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063B0Eu)

/** \brief 2B10, Memory ECC Detection Register */
#define MTU_MC43_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063B10u)

/** \brief 2B12, Error Tracking Register 0 */
#define MTU_MC43_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063B12u)

/** \brief 2B14, Error Tracking Register 1 */
#define MTU_MC43_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063B14u)

/** \brief 2B16, Error Tracking Register 2 */
#define MTU_MC43_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063B16u)

/** \brief 2B18, Error Tracking Register 3 */
#define MTU_MC43_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063B18u)

/** \brief 2B1A, Error Tracking Register 4 */
#define MTU_MC43_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063B1Au)

/** \brief 2B60, Read Data and Bit Flip Register 0 */
#define MTU_MC43_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B60u)

/** \brief 2B62, Read Data and Bit Flip Register 1 */
#define MTU_MC43_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B62u)

/** \brief 2B64, Read Data and Bit Flip Register 2 */
#define MTU_MC43_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063B64u)

