valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxMtu_reg.h
/** \brief 3FCC, Read Data and Bit Flip Register 54 */
#define MTU_MC63_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FCCu)

/** \brief 3FCE, Read Data and Bit Flip Register 55 */
#define MTU_MC63_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FCEu)

/** \brief 3FD0, Read Data and Bit Flip Register 56 */
#define MTU_MC63_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FD0u)

/** \brief 3FD2, Read Data and Bit Flip Register 57 */
#define MTU_MC63_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FD2u)

/** \brief 3FD4, Read Data and Bit Flip Register 58 */
#define MTU_MC63_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FD4u)

/** \brief 3FD6, Read Data and Bit Flip Register 59 */
#define MTU_MC63_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FD6u)

/** \brief 3FD8, Read Data and Bit Flip Register 60 */
#define MTU_MC63_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FD8u)

/** \brief 3FDA, Read Data and Bit Flip Register 61 */
#define MTU_MC63_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FDAu)

/** \brief 3FDC, Read Data and Bit Flip Register 62 */
#define MTU_MC63_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FDCu)

/** \brief 3FDE, Read Data and Bit Flip Register 63 */
#define MTU_MC63_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FDEu)

/** \brief 3FE0, Read Data and Bit Flip Register 64 */
#define MTU_MC63_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FE0u)

/** \brief 3FE2, Read Data and Bit Flip Register 65 */
#define MTU_MC63_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FE2u)

/** \brief 3FE4, Read Data and Bit Flip Register 66 */
#define MTU_MC63_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FE4u)

/** \brief 3FEE, Alarm Sources Configuration Register */
#define MTU_MC63_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0064FEEu)

/** \brief 3FF0, SSH Safety Faults Status Register  */
#define MTU_MC63_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0064FF0u)

/** \brief 3FF2, Error Information Register 0 */
#define MTU_MC63_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064FF2u)

/** \brief 3FF4, Error Information Register 1 */
#define MTU_MC63_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064FF4u)

/** \brief 3FF6, Error Information Register 2 */
#define MTU_MC63_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064FF6u)

/** \brief 3FF8, Error Information Register 3 */
#define MTU_MC63_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064FF8u)

/** \brief 3FFA, Error Information Register 4 */
#define MTU_MC63_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064FFAu)

/** \brief 4000, Configuration Registers */
#define MTU_MC64_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065000u)

/** \brief 4002, Configuration Register 1 */
#define MTU_MC64_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065002u)

/** \brief 4004, MBIST Control Register */
#define MTU_MC64_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065004u)

/** \brief 4006, Status Register */
#define MTU_MC64_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065006u)

/** \brief 4008, Range Register, single address mode */
#define MTU_MC64_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065008u)

/** \brief 400C, Revision ID Register */
#define MTU_MC64_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006500Cu)

/** \brief 400E, ECC Safety Register */
#define MTU_MC64_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006500Eu)

/** \brief 4010, Memory ECC Detection Register */
#define MTU_MC64_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065010u)

/** \brief 4012, Error Tracking Register 0 */
#define MTU_MC64_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065012u)

/** \brief 4014, Error Tracking Register 1 */
#define MTU_MC64_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065014u)

/** \brief 4016, Error Tracking Register 2 */
#define MTU_MC64_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065016u)

/** \brief 4018, Error Tracking Register 3 */
#define MTU_MC64_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065018u)

/** \brief 401A, Error Tracking Register 4 */
#define MTU_MC64_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006501Au)

/** \brief 4060, Read Data and Bit Flip Register 0 */
#define MTU_MC64_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065060u)

/** \brief 4062, Read Data and Bit Flip Register 1 */
#define MTU_MC64_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065062u)

/** \brief 4064, Read Data and Bit Flip Register 2 */
#define MTU_MC64_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065064u)

/** \brief 4066, Read Data and Bit Flip Register 3 */
#define MTU_MC64_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065066u)

/** \brief 4068, Read Data and Bit Flip Register 4 */
#define MTU_MC64_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065068u)

/** \brief 406A, Read Data and Bit Flip Register 5 */
#define MTU_MC64_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006506Au)

/** \brief 406C, Read Data and Bit Flip Register 6 */
#define MTU_MC64_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006506Cu)

/** \brief 406E, Read Data and Bit Flip Register 7 */
#define MTU_MC64_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006506Eu)

/** \brief 4070, Read Data and Bit Flip Register 8 */
#define MTU_MC64_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065070u)

/** \brief 4072, Read Data and Bit Flip Register 9 */
#define MTU_MC64_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065072u)

/** \brief 4074, Read Data and Bit Flip Register 10 */
#define MTU_MC64_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065074u)

