valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxMtu_reg.h
/** \brief 4278, Read Data and Bit Flip Register 12 */
#define MTU_MC66_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065278u)

/** \brief 427A, Read Data and Bit Flip Register 13 */
#define MTU_MC66_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006527Au)

/** \brief 427C, Read Data and Bit Flip Register 14 */
#define MTU_MC66_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006527Cu)

/** \brief 427E, Read Data and Bit Flip Register 15 */
#define MTU_MC66_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006527Eu)

/** \brief 4280, Read Data and Bit Flip Register 16 */
#define MTU_MC66_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065280u)

/** \brief 4282, Read Data and Bit Flip Register 17 */
#define MTU_MC66_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065282u)

/** \brief 4284, Read Data and Bit Flip Register 18 */
#define MTU_MC66_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065284u)

/** \brief 4286, Read Data and Bit Flip Register 19 */
#define MTU_MC66_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065286u)

/** \brief 4288, Read Data and Bit Flip Register 20 */
#define MTU_MC66_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065288u)

/** \brief 428A, Read Data and Bit Flip Register 21 */
#define MTU_MC66_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006528Au)

/** \brief 428C, Read Data and Bit Flip Register 22 */
#define MTU_MC66_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006528Cu)

/** \brief 428E, Read Data and Bit Flip Register 23 */
#define MTU_MC66_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006528Eu)

/** \brief 4290, Read Data and Bit Flip Register 24 */
#define MTU_MC66_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065290u)

/** \brief 4292, Read Data and Bit Flip Register 25 */
#define MTU_MC66_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065292u)

/** \brief 4294, Read Data and Bit Flip Register 26 */
#define MTU_MC66_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065294u)

/** \brief 4296, Read Data and Bit Flip Register 27 */
#define MTU_MC66_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065296u)

/** \brief 4298, Read Data and Bit Flip Register 28 */
#define MTU_MC66_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065298u)

/** \brief 429A, Read Data and Bit Flip Register 29 */
#define MTU_MC66_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006529Au)

/** \brief 429C, Read Data and Bit Flip Register 30 */
#define MTU_MC66_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006529Cu)

/** \brief 429E, Read Data and Bit Flip Register 31 */
#define MTU_MC66_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006529Eu)

/** \brief 42A0, Read Data and Bit Flip Register 32 */
#define MTU_MC66_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652A0u)

/** \brief 42A2, Read Data and Bit Flip Register 33 */
#define MTU_MC66_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652A2u)

/** \brief 42A4, Read Data and Bit Flip Register 34 */
#define MTU_MC66_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652A4u)

/** \brief 42A6, Read Data and Bit Flip Register 35 */
#define MTU_MC66_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652A6u)

/** \brief 42A8, Read Data and Bit Flip Register 36 */
#define MTU_MC66_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652A8u)

/** \brief 42AA, Read Data and Bit Flip Register 37 */
#define MTU_MC66_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652AAu)

/** \brief 42AC, Read Data and Bit Flip Register 38 */
#define MTU_MC66_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652ACu)

/** \brief 42AE, Read Data and Bit Flip Register 39 */
#define MTU_MC66_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652AEu)

/** \brief 42B0, Read Data and Bit Flip Register 40 */
#define MTU_MC66_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652B0u)

/** \brief 42B2, Read Data and Bit Flip Register 41 */
#define MTU_MC66_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652B2u)

/** \brief 42B4, Read Data and Bit Flip Register 42 */
#define MTU_MC66_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652B4u)

/** \brief 42B6, Read Data and Bit Flip Register 43 */
#define MTU_MC66_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652B6u)

/** \brief 42B8, Read Data and Bit Flip Register 44 */
#define MTU_MC66_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652B8u)

/** \brief 42BA, Read Data and Bit Flip Register 45 */
#define MTU_MC66_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652BAu)

/** \brief 42BC, Read Data and Bit Flip Register 46 */
#define MTU_MC66_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652BCu)

/** \brief 42BE, Read Data and Bit Flip Register 47 */
#define MTU_MC66_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652BEu)

/** \brief 42C0, Read Data and Bit Flip Register 48 */
#define MTU_MC66_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652C0u)

/** \brief 42C2, Read Data and Bit Flip Register 49 */
#define MTU_MC66_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652C2u)

/** \brief 42C4, Read Data and Bit Flip Register 50 */
#define MTU_MC66_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652C4u)

/** \brief 42C6, Read Data and Bit Flip Register 51 */
#define MTU_MC66_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652C6u)

/** \brief 42C8, Read Data and Bit Flip Register 52 */
#define MTU_MC66_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652C8u)

/** \brief 42CA, Read Data and Bit Flip Register 53 */
#define MTU_MC66_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652CAu)

/** \brief 42CC, Read Data and Bit Flip Register 54 */
#define MTU_MC66_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00652CCu)

