valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxMtu_reg.h
/** \brief 5C74, Read Data and Bit Flip Register 10 */
#define MTU_MC92_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C74u)

/** \brief 5C76, Read Data and Bit Flip Register 11 */
#define MTU_MC92_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C76u)

/** \brief 5C78, Read Data and Bit Flip Register 12 */
#define MTU_MC92_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C78u)

/** \brief 5C7A, Read Data and Bit Flip Register 13 */
#define MTU_MC92_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C7Au)

/** \brief 5C7C, Read Data and Bit Flip Register 14 */
#define MTU_MC92_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C7Cu)

/** \brief 5C7E, Read Data and Bit Flip Register 15 */
#define MTU_MC92_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C7Eu)

/** \brief 5C80, Read Data and Bit Flip Register 16 */
#define MTU_MC92_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C80u)

/** \brief 5C82, Read Data and Bit Flip Register 17 */
#define MTU_MC92_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C82u)

/** \brief 5C84, Read Data and Bit Flip Register 18 */
#define MTU_MC92_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C84u)

/** \brief 5C86, Read Data and Bit Flip Register 19 */
#define MTU_MC92_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C86u)

/** \brief 5C88, Read Data and Bit Flip Register 20 */
#define MTU_MC92_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C88u)

/** \brief 5C8A, Read Data and Bit Flip Register 21 */
#define MTU_MC92_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C8Au)

/** \brief 5C8C, Read Data and Bit Flip Register 22 */
#define MTU_MC92_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C8Cu)

/** \brief 5C8E, Read Data and Bit Flip Register 23 */
#define MTU_MC92_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C8Eu)

/** \brief 5C90, Read Data and Bit Flip Register 24 */
#define MTU_MC92_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C90u)

/** \brief 5C92, Read Data and Bit Flip Register 25 */
#define MTU_MC92_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C92u)

/** \brief 5C94, Read Data and Bit Flip Register 26 */
#define MTU_MC92_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C94u)

/** \brief 5C96, Read Data and Bit Flip Register 27 */
#define MTU_MC92_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C96u)

/** \brief 5C98, Read Data and Bit Flip Register 28 */
#define MTU_MC92_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C98u)

/** \brief 5C9A, Read Data and Bit Flip Register 29 */
#define MTU_MC92_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C9Au)

/** \brief 5C9C, Read Data and Bit Flip Register 30 */
#define MTU_MC92_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C9Cu)

/** \brief 5C9E, Read Data and Bit Flip Register 31 */
#define MTU_MC92_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066C9Eu)

/** \brief 5CA0, Read Data and Bit Flip Register 32 */
#define MTU_MC92_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CA0u)

/** \brief 5CA2, Read Data and Bit Flip Register 33 */
#define MTU_MC92_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CA2u)

/** \brief 5CA4, Read Data and Bit Flip Register 34 */
#define MTU_MC92_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CA4u)

/** \brief 5CA6, Read Data and Bit Flip Register 35 */
#define MTU_MC92_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CA6u)

/** \brief 5CA8, Read Data and Bit Flip Register 36 */
#define MTU_MC92_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CA8u)

/** \brief 5CAA, Read Data and Bit Flip Register 37 */
#define MTU_MC92_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CAAu)

/** \brief 5CAC, Read Data and Bit Flip Register 38 */
#define MTU_MC92_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CACu)

/** \brief 5CAE, Read Data and Bit Flip Register 39 */
#define MTU_MC92_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CAEu)

/** \brief 5CB0, Read Data and Bit Flip Register 40 */
#define MTU_MC92_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CB0u)

/** \brief 5CB2, Read Data and Bit Flip Register 41 */
#define MTU_MC92_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CB2u)

/** \brief 5CB4, Read Data and Bit Flip Register 42 */
#define MTU_MC92_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CB4u)

/** \brief 5CB6, Read Data and Bit Flip Register 43 */
#define MTU_MC92_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CB6u)

/** \brief 5CB8, Read Data and Bit Flip Register 44 */
#define MTU_MC92_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CB8u)

/** \brief 5CBA, Read Data and Bit Flip Register 45 */
#define MTU_MC92_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CBAu)

/** \brief 5CBC, Read Data and Bit Flip Register 46 */
#define MTU_MC92_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CBCu)

/** \brief 5CBE, Read Data and Bit Flip Register 47 */
#define MTU_MC92_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CBEu)

/** \brief 5CC0, Read Data and Bit Flip Register 48 */
#define MTU_MC92_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CC0u)

/** \brief 5CC2, Read Data and Bit Flip Register 49 */
#define MTU_MC92_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CC2u)

/** \brief 5CC4, Read Data and Bit Flip Register 50 */
#define MTU_MC92_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CC4u)

/** \brief 5CC6, Read Data and Bit Flip Register 51 */
#define MTU_MC92_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066CC6u)

